{
  "abase": {
    "description": "lower in rank or status; humiliate",
    "sentence": "The mentor did not abase the student for mistakes, but gently guided her.",
    "hint1": "This action involves bringing someone down emotionally or socially",
    "hint2": "It means to make someone feel inferior or reduce their dignity publicly",
    "hint3": "Rhymes with 'base' and means to lower someone to a base level"
  },
  "abate": {
    "description": "become less intense or widespread",
    "sentence": "As the storm abated, the sea became calm and tranquil.",
    "hint1": "This describes something becoming weaker or less severe over time",
    "hint2": "Often used to describe storms, pain, fever, or conflicts diminishing",
    "hint3": "Starts with 'ab-' and sounds like 'a-bait' meaning to lessen"
  },
  "abdicate": {
    "description": "give up a position, right, or power",
    "sentence": "The king decided to abdicate the throne in favor of his son.",
    "hint1": "This involves voluntarily giving up something important or powerful",
    "hint2": "Commonly associated with monarchs or leaders stepping down from authority",
    "hint3": "Starts with 'abd-' and relates to renouncing royal power"
  },
  "aberrant": {
    "description": "deviating from the norm; abnormal",
    "sentence": "The scientist observed an aberrant result that deviated from the norm.",
    "hint1": "This describes something that strays from what's typical or expected",
    "hint2": "Used in scientific contexts to describe unusual data or behavior",
    "hint3": "Starts with 'ab-' (away from) and contains 'err' meaning to go astray"
  },
  "acumen": {
    "description": "the ability to make good judgments and quick decisions",
    "sentence": "Her business acumen helped the startup rapidly become profitable.",
    "hint1": "This refers to sharp mental ability in a specific area",
    "hint2": "Often paired with 'business' to describe shrewd decision-making skills",
    "hint3": "Pronounced 'uh-KYOO-men' and comes from Latin meaning sharpness"
  },
  "adroit": {
    "description": "skillful and adept under pressing conditions",
    "sentence": "The debater was adroit at countering complex arguments.",
    "hint1": "This describes someone who is very skillful, especially under pressure",
    "hint2": "Often used to describe mental agility or cleverness in difficult situations",
    "hint3": "Sounds like 'a-droit' and means having dexterity or skill"
  },
  "adulation": {
    "description": "excessive flattery or admiration",
    "sentence": "Despite the crowd's adulation, the artist remained humble.",
    "hint1": "This involves praising someone too much or excessively",
    "hint2": "Often seen from fans toward celebrities or from followers toward leaders",
    "hint3": "Contains 'adult' but means excessive praise that may corrupt"
  },
  "adversity": {
    "description": "difficulties or misfortune",
    "sentence": "He learned to remain positive even in the face of adversity.",
    "hint1": "This refers to challenging times or difficult circumstances",
    "hint2": "Often used in contexts about overcoming hardships or tough situations",
    "hint3": "Contains 'adverse' meaning against you, plus '-ity' making it a condition"
  },
  "affluent": {
    "description": "having a great deal of money; wealthy",
    "sentence": "They lived in an affluent neighborhood with large mansions.",
    "hint1": "This describes someone with abundant financial resources",
    "hint2": "Often used to describe wealthy neighborhoods, families, or societies",
    "hint3": "Sounds like 'a-fluent' as money flows freely to these people"
  },
  "alacrity": {
    "description": "brisk and cheerful readiness",
    "sentence": "She accepted the invitation with alacrity, eager to attend.",
    "hint1": "This describes enthusiastic willingness or quick eagerness",
    "hint2": "Used when someone responds positively and promptly to requests",
    "hint3": "Ends in '-ity' and sounds like 'a-lack-rity' but means eagerness"
  },
  "alleviate": {
    "description": "make suffering, deficiency, or a problem less severe",
    "sentence": "The medicine helped alleviate the pain after surgery.",
    "hint1": "This means to make something painful or difficult less severe",
    "hint2": "Often used with pain, suffering, problems, or burdens to make them lighter",
    "hint3": "Contains 'lev' (light/lift) - to lift away the weight of problems"
  },
  "amalgamate": {
    "description": "combine or unite to form one structure",
    "sentence": "The two companies decided to amalgamate to increase market share.",
    "hint1": "This involves combining different things into a single unified whole",
    "hint2": "Often used in business contexts when companies merge together",
    "hint3": "Contains 'amal' meaning to blend, like making an amalgam in dentistry"
  },
  "ambiguous": {
    "description": "open to more than one interpretation; unclear",
    "sentence": "The politician's ambiguous statement left his position unclear.",
    "hint1": "This describes something that can be understood in multiple ways",
    "hint2": "Often used to describe unclear statements, rules, or situations",
    "hint3": "Contains 'ambi-' meaning both ways, like ambidextrous using both hands"
  },
  "anachronism": {
    "description": "something out of its proper time period",
    "sentence": "Using a smartphone in a medieval setting is an obvious anachronism.",
    "hint1": "This refers to something placed in the wrong time period",
    "hint2": "Like finding modern objects in historical settings or old customs today",
    "hint3": "Contains 'ana' (back) and 'chron' (time) — something back in wrong time"
  },
  "anomaly": {
    "description": "something that deviates from what is standard or expected",
    "sentence": "The engineer noted an anomaly in the test data that required investigation.",
    "hint1": "This describes something unusual that doesn't fit the normal pattern",
    "hint2": "Often used in scientific or statistical contexts for outliers or exceptions",
    "hint3": "Contains 'ano-' meaning not normal, like anonymous means not named"
  },
  "apathy": {
    "description": "lack of interest, enthusiasm, or concern",
    "sentence": "Voter apathy led to a surprisingly low turnout at the polls.",
    "hint1": "This describes a complete lack of interest or emotional involvement",
    "hint2": "Often used to describe voter behavior or student engagement issues",
    "hint3": "Contains 'path' meaning feeling, with 'a-' meaning without feeling"
  },
  "arcane": {
    "description": "understood by few; mysterious or secret",
    "sentence": "The professor's lecture on quantum physics was filled with arcane concepts.",
    "hint1": "This describes knowledge that is secret or understood by very few people",
    "hint2": "Often used to describe specialized academic subjects or ancient mysteries",
    "hint3": "Sounds like 'arc-cane' meaning hidden knowledge that's hard to reach"
  },
  "audacious": {
    "description": "showing a willingness to take bold risks",
    "sentence": "The explorer's audacious plan included crossing the uncharted jungle.",
    "hint1": "This describes someone willing to take bold, risky actions",
    "hint2": "Often used to describe brave explorers, entrepreneurs, or daring plans",
    "hint3": "Contains 'aud' meaning to dare, related to audible meaning heard boldly"
  },
  "austere": {
    "description": "severe or strict in manner; without adornment",
    "sentence": "The monks lived in an austere monastery with few comforts.",
    "hint1": "This describes something plain, simple, and without luxury or decoration",
    "hint2": "Often used to describe monasteries, strict lifestyles, or severe appearances",
    "hint3": "Sounds like 'a-stern' meaning sternly simple without comfort"
  },
  "avarice": {
    "description": "extreme greed for wealth or material gain",
    "sentence": "His avarice drove him to hoard gold and ignore the needs of others.",
    "hint1": "This describes an extreme and selfish desire for wealth or possessions",
    "hint2": "Often used to describe greedy behavior that ignores others' needs",
    "hint3": "Sounds like 'have-a-rice' but means wanting to have everything greedily"
  },

  "belligerent": {
    "description": "hostile and aggressive; warlike",
    "sentence": "Her belligerent attitude made her unpopular among her coworkers.",
    "hint1": "This describes a hostile or combative behavior or attitude",
    "hint2": "Often used to describe aggressive nations or quarrelsome people",
    "hint3": "Sounds like 'bell' (war) + 'gerent' (carrying on) — ready for battle"
  },
  "benevolence": {
    "description": "the quality of being kind and generous",
    "sentence": "Her benevolence was evident when she donated her entire bonus to charity.",
    "hint1": "This describes kindness and a desire to do good for others",
    "hint2": "Often associated with charitable acts or generous donations",
    "hint3": "Starts with 'bene-' meaning good, like benefit or benign"
  },
  "benevolent": {
    "description": "well meaning and kindly",
    "sentence": "Her benevolent nature made everyone feel welcome in the community.",
    "hint1": "This adjective describes a kind-hearted and giving person",
    "hint2": "Often used to describe someone who wishes well to others",
    "hint3": "Shares root with 'benevolence'; ends with '-ent' indicating an adjective"
  },
  "berate": {
    "description": "scold or criticize angrily",
    "sentence": "The coach did not hesitate to berate the players for their lack of effort.",
    "hint1": "This involves angrily scolding or rebuking someone",
    "hint2": "Commonly used in contexts of criticism or reprimanding",
    "hint3": "Sounds a bit like 'berate' = 'beat' someone with words"
  },
  "bestow": {
    "description": "present (an honor or gift)",
    "sentence": "The award committee decided to bestow the prize on the young scientist.",
    "hint1": "This means to give someone something as a gift or honor",
    "hint2": "Often used in formal contexts like awards, honors, or titles",
    "hint3": "Starts with 'be-' which can imply 'on' or 'upon' in old English"
  },
  "bewilder": {
    "description": "cause (someone) to become perplexed",
    "sentence": "The complex puzzle began to bewilder even the most experienced players.",
    "hint1": "This means to confuse or puzzle someone",
    "hint2": "Often used when complexity makes understanding difficult",
    "hint3": "Contains 'wild' suggesting someone lost in confusion"
  },
  "blandish": {
    "description": "coax with kind words or flattery",
    "sentence": "He tried to blandish his boss with compliments to earn a promotion.",
    "hint1": "This describes trying to persuade someone with flattery or gentle words",
    "hint2": "Often involves subtle or smooth-talking to influence",
    "hint3": "Contains 'bland' but ironically means to flatter, not dull"
  },
  "boisterous": {
    "description": "noisy, energetic, and cheerful; rowdy",
    "sentence": "The children were boisterous as they played in the park.",
    "hint1": "This describes noisy and lively behavior",
    "hint2": "Often used to describe crowded parties or playful children",
    "hint3": "Sounds like 'boy-ster-ous' full of youthful energy"
  },
  "cacophony": {
    "description": "a harsh, discordant mixture of sounds",
    "sentence": "A cacophony of car horns filled the city street during the rush hour.",
    "hint1": "This is a harsh or unpleasant mixture of sounds",
    "hint2": "Often describes loud, jarring, or chaotic noise",
    "hint3": "Starts with 'cac-' meaning bad, like cacography (bad writing)"
  },
  "capricious": {
    "description": "given to sudden behavior changes; impulsive",
    "sentence": "The weather is so capricious in spring that you must dress in layers.",
    "hint1": "This describes sudden and unpredictable changes",
    "hint2": "Often used to describe fickle weather or moods",
    "hint3": "Derived from Latin 'capriccio', relating to a sudden whim"
  },
  "catharsis": {
    "description": "the process of releasing strong emotions, providing relief",
    "sentence": "Writing in a journal provides a catharsis for his stress.",
    "hint1": "This is a release or purification of emotional tension",
    "hint2": "Often experienced through art, crying, or talking about feelings",
    "hint3": "From Greek meaning purification or cleansing"
  },
  "cavalier": {
    "description": "showing a lack of proper concern; offhand",
    "sentence": "She had a cavalier disregard for the rules, doing as she pleased.",
    "hint1": "This describes a casual or dismissive attitude",
    "hint2": "Used when someone doesn't take rules or risks seriously",
    "hint3": "Originally meant a mounted soldier or knight, now careless"
  },
  "chaos": {
    "description": "complete disorder and confusion",
    "sentence": "After the power outage, the office descended into chaos.",
    "hint1": "This means total confusion or disorder",
    "hint2": "Often describes messy or unpredictable situations",
    "hint3": "From Greek meaning 'gaping void' or primordial disorder"
  },
  "chauvinist": {
    "description": "believing in the superiority of one's own group, often nationalistic",
    "sentence": "His chauvinist attitude alienated many people in the meeting.",
    "hint1": "This describes excessive loyalty to one's own group",
    "hint2": "Often refers to sexism or aggressive patriotism",
    "hint3": "Named after 'Chauvin', a French soldier known for extreme patriotism"
  },
  "cinematic": {
    "description": "relating to motion pictures",
    "sentence": "The director created a cinematic masterpiece that captivated audiences worldwide.",
    "hint1": "This describes something related to movies or films",
    "hint2": "Often used to describe visual storytelling or grand visuals",
    "hint3": "Comes from 'cinema,' the art of making motion pictures"
  },
  "circumspect": {
    "description": "wary and unwilling to take risks",
    "sentence": "She was circumspect about investing, researching each option carefully.",
    "hint1": "This describes someone cautious and careful",
    "hint2": "Often used when someone carefully considers all risks",
    "hint3": "Contains 'circum-' meaning around, looking all around"
  },
  "clandestine": {
    "description": "kept secret or done secretively",
    "sentence": "They held a clandestine meeting to plan the surprise party.",
    "hint1": "This means secret or hidden, often for illicit reasons",
    "hint2": "Used to describe covert operations or private meetings",
    "hint3": "From Latin 'clam' meaning secretly"
  },
  "coerce": {
    "description": "persuade to do something by using force or threats",
    "sentence": "He tried to coerce his friend into breaking the law, but was refused.",
    "hint1": "This describes forcing someone to do something against their will",
    "hint2": "Often involves threats or pressure to influence behavior",
    "hint3": "Sounds like 'co-erce' meaning pushing or forcing"
  },
  "cogent": {
    "description": "clear, logical, and convincing",
    "sentence": "Her cogent argument convinced the panel to approve the project.",
    "hint1": "This describes an argument that is logical and persuasive",
    "hint2": "Used to praise clear and forceful reasoning",
    "hint3": "Related to 'co-' meaning together and 'agere' to drive or bring"
  },
  "colloquial": {
    "description": "used in ordinary or familiar conversation",
    "sentence": "The novel's dialogue felt authentic because of its colloquial tone.",
    "hint1": "This describes informal language used in everyday speech",
    "hint2": "Often contrasts with formal or literary language",
    "hint3": "From Latin 'colloquium' meaning conversation"
  },
  "concur": {
    "description": "be of the same opinion; agree",
    "sentence": "Both experts concur that this is the most efficient solution.",
    "hint1": "This means to agree or have the same opinion as others",
    "hint2": "Often used in professional or formal consensus contexts",
    "hint3": "From Latin 'con-' together + 'currere' to run"
  },
  "connive": {
    "description": "secretly allow or conspire to do something immoral or illegal",
    "sentence": "They were shocked to discover the neighbors connived to steal their idea.",
    "hint1": "This means secretly cooperating in wrongdoing",
    "hint2": "Involves plotting or turning a blind eye to bad actions",
    "hint3": "Sounds like 'con' + 'knive' meaning a secret stab"
  },
  "consensus": {
    "description": "general agreement among a group",
    "sentence": "After much debate, a consensus was reached on the proposal.",
    "hint1": "This means a collective agreement or harmony",
    "hint2": "Common in meetings when a group decides together",
    "hint3": "From Latin 'consentire' meaning to feel together"
  },
  "construe": {
    "description": "interpret or understand (a word or action)",
    "sentence": "It is difficult to construe his silence on the matter.",
    "hint1": "This means to interpret the meaning of something",
    "hint2": "Often used when figuring out ambiguous language or behavior",
    "hint3": "From Latin 'construere' meaning to build, assemble meaning"
  },
  "conundrum": {
    "description": "a confusing and difficult problem or question",
    "sentence": "The riddle posed quite a conundrum that stumped everyone.",
    "hint1": "This refers to a puzzling or tricky problem",
    "hint2": "Commonly used to describe riddles or complicated dilemmas",
    "hint3": "Possibly from sound imitation or a coined humorous term"
  },
  "conviction": {
    "description": "a firmly held belief",
    "sentence": "Her conviction that justice will prevail inspired everyone around her.",
    "hint1": "This means a strong, unwavering belief or opinion",
    "hint2": "Often refers to moral or ideological certainty",
    "hint3": "From Latin 'convincere' meaning to overcome or convince"
  },
  "copious": {
    "description": "abundant in supply; plentiful",
    "sentence": "The report was filled with copious data and detailed charts.",
    "hint1": "This means in large quantity or abundance",
    "hint2": "Used to describe plentiful amounts, like data or food",
    "hint3": "From Latin 'copia' meaning plenty or supply"
  },
  "cumulative": {
    "description": "increasing or increased by successive additions",
    "sentence": "The cumulative effect of the donations was astounding.",
    "hint1": "This describes something that builds up over time",
    "hint2": "Often used to describe effects or totals that add up",
    "hint3": "From Latin 'cum-' meaning with + 'ulari' to increase"
  },
  "cursory": {
    "description": "hasty and therefore not thorough or detailed",
    "sentence": "He gave the document a cursory glance but signed it without reading.",
    "hint1": "This means done quickly and without attention to detail",
    "hint2": "Often applies to reading or examining something superficially",
    "hint3": "From Latin 'cursor' meaning runner, indicating speed"
  },
  "dearth": {
    "description": "a scarcity or lack of something",
    "sentence": "The region suffered a dearth of clean water during the drought.",
    "hint1": "This means there is not enough of something; shortage",
    "hint2": "Used when supplies, resources, or qualities are insufficient",
    "hint3": "Related to an old English word meaning 'precious' or rare"
  },
  "debacle": {
    "description": "a sudden and ignominious failure; a fiasco",
    "sentence": "The product launch turned into a debacle when the software crashed.",
    "hint1": "This means a complete disaster or failure",
    "hint2": "Often used to describe public or dramatic collapses",
    "hint3": "From French meaning a breaking up of ice in a river"
  },
  "debilitate": {
    "description": "make someone weak and infirm",
    "sentence": "The illness served to debilitate him, leaving him bedridden.",
    "hint1": "This means to weaken or sap strength",
    "hint2": "Often used in medical contexts about illness or injury",
    "hint3": "Has the root 'de-' implying removal and 'bilitate' related to ability"
  },
  "decorum": {
    "description": "behavior in keeping with good taste and propriety",
    "sentence": "The students were expected to act with decorum during the formal dinner.",
    "hint1": "This means proper and polite behavior",
    "hint2": "Often associated with formal events or social etiquette",
    "hint3": "Derived from Latin meaning 'right, proper, ornament'"
  },
  "deference": {
    "description": "humble submission and respect",
    "sentence": "Out of deference to tradition, they observed the annual ceremonies.",
    "hint1": "This means showing respect or yielding to someone's wishes",
    "hint2": "Typically used toward elders, traditions, or authority figures",
    "hint3": "Comes from Latin 'deferre' which means to carry down or yield"
  },
  "deleterious": {
    "description": "causing harm or damage",
    "sentence": "Smoking can have deleterious effects on your health.",
    "hint1": "This means harmful or damaging",
    "hint2": "Used often in health or environmental contexts",
    "hint3": "Contains 'delete' meaning to remove, harmful in impact"
  },
  "denounce": {
    "description": "publicly declare to be wrong or evil",
    "sentence": "They decided to denounce the corrupt official at the press conference.",
    "hint1": "This means to publicly criticize or condemn",
    "hint2": "Often occurs in politics or social justice contexts",
    "hint3": "Prefix 'de-' (down) + 'nounce' (announce) suggesting a public accusation"
  },
  "deride": {
    "description": "express contempt for; ridicule",
    "sentence": "Bullies often deride those who are different.",
    "hint1": "This means to mock or ridicule someone",
    "hint2": "Often associated with verbal abuse or scorn",
    "hint3": "Has a harsh sound matching its meaning of contempt"
  },
  "declaim": {
    "description": "utter or deliver words in a rhetorical or impassioned way",
    "sentence": "The politician began to declaim against the injustices he witnessed.",
    "hint1": "This means to speak loudly and forcefully",
    "hint2": "Often used to describe formal speeches or oratory",
    "hint3": "'De-' (down) + 'claim' (call out) means to strongly deliver speech"
  },
  "decrepit": {
    "description": "worn out or ruined because of age or neglect",
    "sentence": "They lived in a decrepit old mansion on the hill.",
    "hint1": "This describes something old and in poor condition",
    "hint2": "Often used for buildings, machines, or people who are frail",
    "hint3": "From Latin meaning 'weakened by age'"
  },
  "diffident": {
    "description": "modest or shy because of a lack of self-confidence",
    "sentence": "The normally diffident student surprised everyone with her eloquent speech.",
    "hint1": "This describes someone shy and lacking confidence",
    "hint2": "Often seen in social situations or public speaking",
    "hint3": "Contains 'fid' root meaning faith or trust, with a negative prefix 'dif-'"
  },
  "diminutive": {
    "description": "extremely or unusually small",
    "sentence": "Despite his diminutive stature, he had an imposing presence.",
    "hint1": "This means very small or tiny",
    "hint2": "Often used to describe small objects or people",
    "hint3": "Related to 'diminuere' Latin for 'to lessen'"
  },
  "disdain": {
    "description": "the feeling that something is unworthy of one's consideration",
    "sentence": "She looked at the messy desk with disdain.",
    "hint1": "This means a strong feeling of dislike or contempt",
    "hint2": "Often involves ignoring or dismissing something as unworthy",
    "hint3": "From Latin 'dis-' (apart) and 'dignus' (worthy)"
  },
  "disseminate": {
    "description": "spread or disperse widely",
    "sentence": "The internet helps disseminate information faster than ever.",
    "hint1": "This means to spread something widely",
    "hint2": "Often used for information, ideas, or seeds",
    "hint3": "From Latin 'dis-' apart + 'seminare' to sow seeds"
  },
  "dissent": {
    "description": "hold or express opinions at variance with the majority",
    "sentence": "To dissent publicly could have consequences.",
    "hint1": "This means to disagree or differ in opinion",
    "hint2": "Often political or social disagreement",
    "hint3": "From Latin 'dis-' apart + 'sentire' to feel"
  },
  "distortion": {
    "description": "the action of giving a misleading account or impression",
    "sentence": "He refused to listen to any distortion of the facts.",
    "hint1": "This means twisting or misrepresenting something",
    "hint2": "Often used in context of images, sounds, or truths",
    "hint3": "Root 'tor-' means twist or turn"
  },
  "dissident": {
    "description": "a person who opposes official policy",
    "sentence": "The dissident criticized the government's new regulations.",
    "hint1": "This means a person who disagrees with established authority",
    "hint2": "Common in political or religious contexts",
    "hint3": "Related to dissent; suffix '-ent' indicating a person"
  },
  "dogmatic": {
    "description": "inclined to lay down principles as incontrovertibly true",
    "sentence": "He was dogmatic about his views and refused to listen.",
    "hint1": "This describes someone stubbornly asserting opinions",
    "hint2": "Often negative when someone is inflexible in beliefs",
    "hint3": "From Greek 'dogma' meaning opinion or decree"
  },
  "dour": {
    "description": "sullen; gloomy",
    "sentence": "His dour expression told me that he had not slept well.",
    "hint1": "This means serious, gloomy, or stern",
    "hint2": "Often used to describe facial expressions or mood",
    "hint3": "Sounds like 'door' but implies closed-off or stern demeanour"
  },
  "dubious": {
    "description": "hesitating or doubting; not to be relied upon",
    "sentence": "He was dubious about the truth of the rumors.",
    "hint1": "This means doubtful or uncertain",
    "hint2": "Often describes suspicion or questionable reliability",
    "hint3": "From Latin 'dubius' meaning doubtful"
  },
  "durable": {
    "description": "able to withstand wear, pressure, or damage",
    "sentence": "She bought a durable pair of boots for the harsh winter.",
    "hint1": "This means long-lasting or tough",
    "hint2": "Often used to describe materials or products",
    "hint3": "From Latin 'durare' meaning to last or endure"
  },
  "eccentric": {
    "description": "unconventional and slightly strange",
    "sentence": "The eccentric artist painted bright murals on every wall of her house.",
    "hint1": "This means odd or unusual in behavior",
    "hint2": "Often used to describe quirky individuals",
    "hint3": "From Greek 'ekkentros' meaning 'out of center'"
  },
  "elated": {
    "description": "extremely happy and excited",
    "sentence": "She was elated when she learned she got the scholarship.",
    "hint1": "This means very joyful or overjoyed",
    "hint2": "Often describes strong positive feelings after success",
    "hint3": "From Latin 'elatus' meaning 'raised up'"
  },
  "electrify": {
    "description": "to shock or thrill someone",
    "sentence": "The guitarist managed to electrify the audience with his solo.",
    "hint1": "This means to excite or thrill greatly",
    "hint2": "Often associated with causing strong emotional reactions",
    "hint3": "Contains 'electric' root related to electricity, giving a jolt"
  },
  "elicit": {
    "description": "evoke or draw out (a reaction or response)",
    "sentence": "The comedian's jokes would often elicit laughter from the crowd.",
    "hint1": "This means to bring forth a reaction or response",
    "hint2": "Often used in contexts of drawing out emotions or information",
    "hint3": "Sounds like 'e-licit' meaning to 'call out' or 'draw forth'"
  },
  "embellish": {
    "description": "make (something) more attractive by adding decorative details",
    "sentence": "She decided to embellish her speech with a few anecdotes.",
    "hint1": "This means to decorate or add extra details to something",
    "hint2": "Often used to enhance stories, clothes, or physical objects",
    "hint3": "Starts with 'em-' meaning to put in or on + 'bell' (beautiful)"
  },
  "empirical": {
    "description": "based on observation or experiment",
    "sentence": "The theory needed empirical evidence before it could be accepted.",
    "hint1": "This means based on actual experience or data",
    "hint2": "Opposite of theoretical knowledge; relies on experiments",
    "hint3": "Contains 'empir-' root relating to experience or practice"
  },
  "enigmatic": {
    "description": "mysterious; difficult to understand",
    "sentence": "His smile was enigmatic, leaving everyone guessing his true feelings.",
    "hint1": "This describes something puzzling or hard to explain",
    "hint2": "Often refers to mysterious expressions, persons, or situations",
    "hint3": "Related to the word 'enigma,' meaning a riddle or mystery"
  },
  "ephemeral": {
    "description": "lasting for a very short time",
    "sentence": "The beauty of a sunset is ephemeral.",
    "hint1": "This means temporary or fleeting",
    "hint2": "Often used to describe things that quickly pass or disappear",
    "hint3": "Starts with 'eph-' meaning upon or over + 'hemera' meaning day"
  },
  "epiphany": {
    "description": "a sudden realization or insight",
    "sentence": "It was an epiphany when he finally understood the solution.",
    "hint1": "This means a sudden, enlightening realization",
    "hint2": "Often refers to moments of clarity or understanding",
    "hint3": "From Greek meaning a manifestation or striking appearance"
  },
  "equanimity": {
    "description": "mental calmness and composure",
    "sentence": "Despite the chaos, he maintained his equanimity.",
    "hint1": "This describes calmness under pressure or in difficult situations",
    "hint2": "Often used to describe emotional steadiness or poise",
    "hint3": "Comes from Latin 'aequus' meaning equal + 'animus' mind"
  },
  "eradicate": {
    "description": "destroy completely; put an end to",
    "sentence": "Efforts were made to eradicate the invasive plant species.",
    "hint1": "This means to completely remove or destroy",
    "hint2": "Often used for diseases, pests, or problems",
    "hint3": "From Latin 'radix' meaning root; literally 'to pull up by the root'"
  },
  "ethical": {
    "description": "pertaining to moral principles",
    "sentence": "She faced an ethical dilemma about telling the truth.",
    "hint1": "This relates to principles of right and wrong behavior",
    "hint2": "Often involves issues of morality, duties, and values",
    "hint3": "Related to the word 'ethos,' meaning character or custom"
  },
  "estranged": {
    "description": "no longer close or affectionate to someone",
    "sentence": "The estranged siblings met only once a year.",
    "hint1": "This means alienated or separated in relationship",
    "hint2": "Often used for family or friends who have grown apart",
    "hint3": "Derived from Latin 'extraneus' meaning being outside or foreign"
  },
  "eulogy": {
    "description": "speech that praises someone highly",
    "sentence": "He delivered a touching eulogy at his grandmother's funeral.",
    "hint1": "This is a speech or writing in praise of someone, typically deceased",
    "hint2": "Often given at funerals or memorial services",
    "hint3": "From Greek 'eu' good + 'logia' speaking or discourse"
  },
  "fervent": {
    "description": "having or displaying a passionate intensity",
    "sentence": "She was a fervent advocate for animal rights.",
    "hint1": "This describes strong and passionate feelings",
    "hint2": "Often used to describe dedication or spirited enthusiasm",
    "hint3": "From Latin 'fervere' meaning to boil, to be hot"
  },
  "flagitious": {
    "description": "criminal; villainous",
    "sentence": "The serial thief's flagitious acts were well known to the police.",
    "hint1": "This means extremely wicked or criminal",
    "hint2": "Often describes serious offenses or immoral behavior",
    "hint3": "Rare word from Latin 'flagitium' meaning disgraceful act"
  },
  "flagrant": {
    "description": "conspicuously or obviously offensive",
    "sentence": "The referee ignored the flagrant foul.",
    "hint1": "This means shockingly bad or glaringly wrong",
    "hint2": "Often describes blatant violations or fouls",
    "hint3": "From Latin 'flagrare' meaning to burn or blaze"
  },
  "futile": {
    "description": "incapable of producing any useful result; pointless",
    "sentence": "Protesting seemed futile in front of the unyielding judge.",
    "hint1": "This means useless or ineffective",
    "hint2": "Often describes attempts or efforts unlikely to succeed",
    "hint3": "From Latin 'futilis' meaning leaking, worthless"
  },
  "gaudy": {
    "description": "extravagantly bright; showy",
    "sentence": "The decorations were so gaudy that they hurt his eyes.",
    "hint1": "This means excessively or tastelessly decorated",
    "hint2": "Often used to describe flashy clothes or ornaments",
    "hint3": "Related to 'gaud' meaning a fool’s trick or show"
  },
  "genial": {
    "description": "friendly and cheerful",
    "sentence": "The genial host greeted each guest with a warm smile.",
    "hint1": "This means pleasantly warm and friendly",
    "hint2": "Often describes people or environments that make others comfortable",
    "hint3": "From Latin 'genialis' meaning festive or agreeable"
  },
  "gullible": {
    "description": "easily persuaded to believe something",
    "sentence": "He was so gullible that any tall tale would convince him.",
    "hint1": "This means easily tricked or deceived",
    "hint2": "Often describes a trusting or naive person",
    "hint3": "Rhymes with 'pullible' but means easily fooled"
  },
  "gratuitous": {
    "description": "uncalled for; lacking good reason",
    "sentence": "The movie had a gratuitous violent scene that many found unnecessary.",
    "hint1": "This means unnecessary or without justification",
    "hint2": "Often describes violence, comments, or actions that seem over the top",
    "hint3": "From Latin 'gratuitus' meaning free or voluntary"
  },
  "haughty": {
    "description": "arrogantly superior",
    "sentence": "She gave a haughty look to the man who had insulted her.",
    "hint1": "This means arrogantly proud or disdainful",
    "hint2": "Often describes a condescending attitude",
    "hint3": "Sounds like 'naughty' but means proudly snobbish"
  },
  "harried": {
    "description": "feeling strained by demands; harassed",
    "sentence": "She seemed harried after juggling work and family.",
    "hint1": "This means feeling stressed or harassed",
    "hint2": "Often describes someone overwhelmed with tasks or troubles",
    "hint3": "From Old English 'hergian' meaning to harass"
  },
  "hypocritical": {
    "description": "behaving in a way that suggests high standards not followed",
    "sentence": "Criticizing others for faults he had himself was clearly hypocritical.",
    "hint1": "This means pretending to have virtues or beliefs one does not have",
    "hint2": "Often involves insincerity or double standards",
    "hint3": "From Greek 'hypokrites' meaning actor or dissembler"
  },
  "humane": {
    "description": "showing compassion or benevolence",
    "sentence": "The humane treatment of the animals impressed the visitors.",
    "hint1": "This means kind and compassionate towards others",
    "hint2": "Often used for treatment of people or animals",
    "hint3": "From Latin 'humanus' meaning human or kind"
  },
  "imbue": {
    "description": "inspire or permeate with a feeling",
    "sentence": "The teacher tried to imbue students with a love of reading.",
    "hint1": "This means to fill or infuse something deeply",
    "hint2": "Often refers to emotions, ideas, or qualities being instilled",
    "hint3": "From Latin 'imbuere' meaning to moisten or saturate"
  },
  "imbalance": {
    "description": "lack of proportion or relation between corresponding things",
    "sentence": "An imbalance in the ecosystem can lead to severe consequences.",
    "hint1": "This means unequal or disproportionate",
    "hint2": "Often used for health, ecosystems, or power distributions",
    "hint3": "Prefix 'im-' means not, combined with 'balance'"
  },
  "implement": {
    "description": "put into effect according to a plan or procedure",
    "sentence": "The school will implement the new policies next semester.",
    "hint1": "This means to carry out or put a plan into action",
    "hint2": "Often used in contexts of policies, ideas, or systems",
    "hint3": "From Latin 'implere' meaning to fill up or accomplish"
  },
  "impromptu": {
    "description": "done without being planned in advance",
    "sentence": "She gave an impromptu speech when the main speaker was delayed.",
    "hint1": "This means spontaneous or without preparation",
    "hint2": "Often used for performances or remarks made on the spot",
    "hint3": "From Latin 'in promptu' meaning 'in readiness'"
  },
  "incisive": {
    "description": "clear and sharp in expression or thought",
    "sentence": "His incisive question cut right to the heart of the issue.",
    "hint1": "This means clear, direct, and sharp",
    "hint2": "Often describes sharp intellect or cutting remarks",
    "hint3": "From Latin 'incidere' meaning to cut into"
  },
  "indelible": {
    "description": "making marks that cannot be erased; memorable",
    "sentence": "The experience left an indelible mark on her mind.",
    "hint1": "This means permanent and impossible to remove",
    "hint2": "Often used for memories or marks that last a lifetime",
    "hint3": "Prefix 'in-' means not, 'delere' means to destroy"
  },
  "inherent": {
    "description": "existing as a permanent attribute",
    "sentence": "There is an inherent difficulty in this problem.",
    "hint1": "This means intrinsic or built-in",
    "hint2": "Often describes qualities or features naturally part of something",
    "hint3": "From Latin 'inhaerere' meaning to stick or cling"
  },
  "innocuous": {
    "description": "not harmful or offensive",
    "sentence": "The comment was innocuous and caused no offense.",
    "hint1": "This means harmless and unlikely to offend",
    "hint2": "Often describes actions or remarks that are safe",
    "hint3": "Prefix 'in-' means not + 'nocuus' means harmful"
  },
  "inundate": {
    "description": "overwhelm with a large amount of something",
    "sentence": "The office was inundated with calls after the announcement.",
    "hint1": "This means to flood or overwhelm",
    "hint2": "Often used when large amounts of people or things come at once",
    "hint3": "From Latin 'unda' meaning wave"
  },
  "irascible": {
    "description": "easily angered",
    "sentence": "The old man was known to be irascible after midnight.",
    "hint1": "This means quick to anger or hot-tempered",
    "hint2": "Often used to describe someone grumpy or easily annoyed",
    "hint3": "From Latin 'irasci' which means to become angry"
  },
  "ire": {
    "description": "anger; wrath",
    "sentence": "His unjust treatment earned him the ire of the villagers.",
    "hint1": "This means intense anger",
    "hint2": "Often used in literary or formal contexts",
    "hint3": "A short, one-syllable word often seen with 'to raise'"
  },
  "irreverent": {
    "description": "showing lack of respect for things taken seriously",
    "sentence": "His irreverent comments about the ceremony shocked the audience.",
    "hint1": "This means disrespectful or lacking proper respect",
    "hint2": "Often refers to attitudes or remarks about sacred or important things",
    "hint3": "Prefix 'ir-' means not + 'reverent' meaning respectful"
  },
  "irate": {
    "description": "extremely angry",
    "sentence": "He wrote an irate letter to the editor about the recent policy change.",
    "hint1": "This means very angry or furious",
    "hint2": "Used especially to describe intense emotions",
    "hint3": "Sounds like 'eye-rate' but means angry"
  },
  "joviality": {
    "description": "cheerful and friendly mood",
    "sentence": "The joviality of the party was infectious.",
    "hint1": "This means a joyful, happy atmosphere",
    "hint2": "Often describes social gatherings or people’s mood",
    "hint3": "Derived from 'Jove', the Roman god of joy"
  },
  "judicious": {
    "description": "showing or done with good judgment or sense",
    "sentence": "Her judicious advice helped me solve the difficult problem.",
    "hint1": "This means wise and sensible",
    "hint2": "Often describes decisions or advice that are careful and sound",
    "hint3": "Related to 'judge', implying good judgment"
  },
  "kinetic": {
    "description": "relating to or resulting from motion",
    "sentence": "The exhibit showcased kinetic sculptures that moved with the wind.",
    "hint1": "This describes movement or motion",
    "hint2": "Used in physics or art involving movement",
    "hint3": "From Greek 'kinesis' meaning movement"
  },
  "kindle": {
    "description": "arouse or inspire",
    "sentence": "The teacher hoped to kindle a love of science in her students.",
    "hint1": "This means to start or ignite",
    "hint2": "Often used metaphorically for inspiring feelings or ideas",
    "hint3": "Literally means to set fire to something small"
  },
  "keen": {
    "description": "having or showing eagerness or enthusiasm",
    "sentence": "She had a keen interest in learning foreign languages.",
    "hint1": "This means highly enthusiastic or sharp",
    "hint2": "Often describes interest, senses, or intellect",
    "hint3": "A short word often paired with 'interest' or 'intellect'"
  },
  "layman": {
    "description": "a non-expert in a field",
    "sentence": "He explained the scientific concept in layman's terms.",
    "hint1": "This means an ordinary person, not specialized",
    "hint2": "Often used to describe explanations accessible to everyone",
    "hint3": "Opposite of an expert or professional"
  },
  "lexicon": {
    "description": "vocabulary of a person or language",
    "sentence": "She had a rich lexicon of culinary terms.",
    "hint1": "This means the vocabulary of a language or field",
    "hint2": "Often used in linguistics or to describe personal word knowledge",
    "hint3": "From Greek meaning 'word' or 'speech'"
  },
  "lucid": {
    "description": "clear; easy to understand",
    "sentence": "He gave a lucid explanation of the complex theory.",
    "hint1": "This means clear and understandable",
    "hint2": "Often used to describe writing or thinking",
    "hint3": "From Latin meaning 'light' or 'to shine'"
  },
  "magnanimous": {
    "description": "generous or forgiving, especially toward a rival",
    "sentence": "She was magnanimous in victory, praising her opponent's effort.",
    "hint1": "This means showing generosity or nobility of spirit",
    "hint2": "Often used to describe forgiveness after competition or conflict",
    "hint3": "From Latin 'magnus' meaning great + 'animus' meaning soul"
  },
  "magnate": {
    "description": "a wealthy and influential person in business",
    "sentence": "The real estate magnate built an empire in just a decade.",
    "hint1": "This means a powerful and wealthy businessperson",
    "hint2": "Often describes industrialists or tycoons",
    "hint3": "Derived from Latin 'magnus' meaning great"
  },
  "malevolent": {
    "description": "having a wish to do evil to others",
    "sentence": "His malevolent glare sent shivers down their spines.",
    "hint1": "This means having or showing ill will or evil intentions",
    "hint2": "Often used to describe harmful or spiteful behavior",
    "hint3": "From Latin 'male' meaning badly + 'volent' from wishing"
  },
  "malleable": {
    "description": "easily influenced; pliable",
    "sentence": "Gold is a malleable metal that can be shaped easily.",
    "hint1": "This means capable of being shaped or easily influenced",
    "hint2": "Used for metals as well as personalities or opinions",
    "hint3": "From Latin 'malleus' meaning hammer"
  },
  "marred": {
    "description": "spoiled or damaged",
    "sentence": "The once beautiful painting was marred by years of neglect.",
    "hint1": "This means damaged or made less perfect",
    "hint2": "Often used to describe ruined appearance or reputation",
    "hint3": "Past tense of a short word meaning to spoil"
  },
  "meager": {
    "description": "lacking in quantity or quality",
    "sentence": "They survived on a meager diet during the winter.",
    "hint1": "This means insufficient or scanty",
    "hint2": "Often describes small portions or limited resources",
    "hint3": "Sounds like 'major' but means very little"
  },
  "mediocre": {
    "description": "of only average quality; not very good",
    "sentence": "The movie received only mediocre reviews from critics.",
    "hint1": "This means average or below expectations",
    "hint2": "Often used to describe performances or results",
    "hint3": "From Latin 'medius' meaning middle"
  },
  "metamorphosis": {
    "description": "a transformation or dramatic change",
    "sentence": "The caterpillar's metamorphosis into a butterfly amazed the children.",
    "hint1": "This means a change of form, shape, or nature",
    "hint2": "Commonly used for biological or metaphorical transformations",
    "hint3": "From Greek 'meta' meaning change and 'morph' meaning form"
  },
  "modernize": {
    "description": "adapt to modern needs or habits",
    "sentence": "The museum decided to modernize its exhibits with interactive displays.",
    "hint1": "This means to update or bring up to date",
    "hint2": "Used when making something suitable for current times",
    "hint3": "From the English word 'modern' with a verb ending"
  },
  "mollify": {
    "description": "make less angry or severe; soothe",
    "sentence": "She tried to mollify the irate customer with a free coupon.",
    "hint1": "This means to calm or appease anger or anxiety",
    "hint2": "Often used when soothing someone upset or agitated",
    "hint3": "From Latin 'mollis' meaning soft"
  },
  "magnitude": {
    "description": "great size or extent",
    "sentence": "The magnitude of the earthquake was measured at 7.2.",
    "hint1": "This means the great size or importance of something",
    "hint2": "Often refers to the strength of natural phenomena",
    "hint3": "From Latin 'magnus' meaning great"
  },
  "manifest": {
    "description": "clear or obvious",
    "sentence": "The joy on her face was manifest when she won.",
    "hint1": "This means clearly revealed or obvious",
    "hint2": "Often describes visible or easily recognized signs",
    "hint3": "From Latin 'manifestus' meaning obvious"
  },
  "mundane": {
    "description": "lacking interest or excitement; dull",
    "sentence": "He performed the mundane task of filing papers.",
    "hint1": "This means ordinary or unexciting",
    "hint2": "Often describes daily routine or commonplace things",
    "hint3": "From Latin 'mundus' meaning world, relating to worldly"
  },
  "naive": {
    "description": "showing lack of experience or judgment",
    "sentence": "He was naive to believe everything he heard.",
    "hint1": "This means innocent or inexperienced",
    "hint2": "Often used for trusting too easily or being simple-minded",
    "hint3": "From French 'naïf' meaning natural or native"
  },
  "negligent": {
    "description": "failing to take proper care in doing something",
    "sentence": "The negligent driver did not notice the pedestrian.",
    "hint1": "This means careless or neglectful",
    "hint2": "Often describes failure to fulfill responsibilities",
    "hint3": "From Latin 'neglegere' meaning to disregard"
  },
  "notorious": {
    "description": "famous for something bad",
    "sentence": "The outlaw was notorious across the frontier.",
    "hint1": "This means well-known for a negative reason",
    "hint2": "Often used for criminals or scandals",
    "hint3": "From Latin 'notus' meaning known"
  },
  "novelty": {
    "description": "the quality of being new or original",
    "sentence": "The novelty of virtual reality technology intrigued him.",
    "hint1": "This means something new or unusual",
    "hint2": "Often describes innovations or initial excitement",
    "hint3": "From Latin 'novus' meaning new"
  },
  "pellucid": {
    "description": "transparent or clear",
    "sentence": "The mountain lake was so pellucid that you could see the bottom clearly.",
    "hint1": "This means very clear or easy to understand",
    "hint2": "Often describes water, glass, or explanations",
    "hint3": "Contains 'lucid' meaning clear and bright"
  },
  "penchant": {
    "description": "a strong or habitual liking for something",
    "sentence": "She has a penchant for classical music, attending concerts regularly.",
    "hint1": "This means a strong preference or liking",
    "hint2": "Often used to describe hobbies or habitual interests",
    "hint3": "From French meaning 'to hang down' indicating a leaning"
  },
  "penitent": {
    "description": "feeling or showing sorrow and regret for having done wrong",
    "sentence": "The penitent criminal expressed remorse before the judge.",
    "hint1": "This means sorry for past misdeeds",
    "hint2": "Often used in religious or moral contexts",
    "hint3": "Rooted in Latin 'paenitere' meaning to repent"
  },
  "pensive": {
    "description": "engaged in serious thought",
    "sentence": "He sat in a pensive mood, reflecting on his career choices.",
    "hint1": "This means deeply or seriously thoughtful",
    "hint2": "Often suggests quiet or sometimes melancholy thinking",
    "hint3": "From Latin 'pensare' meaning to weigh or consider"
  },
  "perfunctory": {
    "description": "carried out with a minimum of effort or reflection",
    "sentence": "She gave a perfunctory nod and continued on her way.",
    "hint1": "This means done hastily and without care",
    "hint2": "Often describes shallow or mechanical actions",
    "hint3": "From Latin 'per' (through) + 'fungi' (to perform)"
  },
  "pernicious": {
    "description": "having a harmful effect, especially in a gradual or subtle way",
    "sentence": "The pernicious weed spread rapidly, choking native plants.",
    "hint1": "This means very harmful or destructive",
    "hint2": "Often used for things that cause damage gradually",
    "hint3": "Derived from Latin 'perniciosus' meaning destructive"
  },
  "perpetuate": {
    "description": "make something continue indefinitely",
    "sentence": "Spreading rumors will only perpetuate misunderstandings.",
    "hint1": "This means to keep something going without end",
    "hint2": "Often refers to ideas, traditions, or problems",
    "hint3": "Contains 'per-' meaning through and 'pet' meaning seek"
  },
  "phantom": {
    "description": "something that seems real but is not; ghost",
    "sentence": "He chased phantom fears about the future.",
    "hint1": "This means an illusion or ghostly apparition",
    "hint2": "Often refers to something elusive or not tangible",
    "hint3": "From Greek meaning apparition or spirit"
  },
  "philanthropy": {
    "description": "the desire to promote the welfare of others",
    "sentence": "She engaged in philanthropy by building schools in impoverished areas.",
    "hint1": "This means charitable giving and kindness to others",
    "hint2": "Often associated with donations and social causes",
    "hint3": "From Greek meaning love of humanity"
  },
  "phenomenon": {
    "description": "an observable fact or event",
    "sentence": "Auroras are a natural phenomenon seen in polar regions.",
    "hint1": "This means something remarkable or observable",
    "hint2": "Often refers to natural or scientific occurrences",
    "hint3": "From Greek meaning appearance or fact"
  },
  "pious": {
    "description": "deeply religious or virtuous",
    "sentence": "Her pious devotion led her to volunteer at the church.",
    "hint1": "This means showing strong religious commitment",
    "hint2": "Can also mean strictly following moral duties",
    "hint3": "From Latin 'pius' meaning dutiful or devout"
  },
  "placid": {
    "description": "calm and peaceful",
    "sentence": "The lake was placid in the early morning light.",
    "hint1": "This means peaceful and undisturbed",
    "hint2": "Often used for weather, lakes, or temperaments",
    "hint3": "From Latin 'placidus' meaning gentle or calm"
  },
  "plausible": {
    "description": "seeming reasonable; believable",
    "sentence": "Her explanation was plausible, so they believed her story.",
    "hint1": "This means appearing believable or likely",
    "hint2": "Often used for arguments or excuses",
    "hint3": "From Latin 'plausibilis' meaning applause-worthy"
  },
  "plethora": {
    "description": "an excess of something",
    "sentence": "There was a plethora of ideas during the brainstorming session.",
    "hint1": "This means a large or excessive amount",
    "hint2": "Used when there’s more than enough of something",
    "hint3": "From Greek meaning 'fullness'"
  },
  "plight": {
    "description": "a difficult or dangerous situation",
    "sentence": "They were rescued from their plight by kind neighbors.",
    "hint1": "This means a serious or unfortunate condition",
    "hint2": "Often used to describe hardship or trouble",
    "hint3": "From Old English meaning to pledge or plight"
  },
  "plagiarize": {
    "description": "copy and pass off someone else's work as one's own",
    "sentence": "Students are warned not to plagiarize assignments.",
    "hint1": "This means to steal someone else's work or ideas",
    "hint2": "Commonly related to academic dishonesty",
    "hint3": "From Latin 'plagiarius' meaning kidnapper"
  },
  "precocious": {
    "description": "developing abilities at an earlier age than usual",
    "sentence": "The precocious child could read by age three.",
    "hint1": "This means unusually advanced at a young age",
    "hint2": "Often used to describe children showing early talent",
    "hint3": "From Latin 'praecox' meaning ripening early"
  },
  "predicament": {
    "description": "a difficult or unpleasant situation",
    "sentence": "Losing his job put him in a financial predicament.",
    "hint1": "This means a troubling or precarious situation",
    "hint2": "Often involves confusion or difficulty",
    "hint3": "From Latin 'praedicamentum' meaning condition or state"
  },
  "preclude": {
    "description": "prevent from happening; make impossible",
    "sentence": "Poor planning may preclude success.",
    "hint1": "This means to stop something from happening",
    "hint2": "Often used in legal or procedural contexts",
    "hint3": "From Latin 'praecludere' meaning to shut beforehand"
  },
  "procrastinate": {
    "description": "delay or postpone action",
    "sentence": "He would procrastinate on homework until the last minute.",
    "hint1": "This means to put off doing something",
    "hint2": "Often leads to missed deadlines or stress",
    "hint3": "From Latin 'pro' forward + 'crastinus' belonging to tomorrow"
  },
  "proliferate": {
    "description": "increase rapidly in numbers; multiply",
    "sentence": "Social media platforms continue to proliferate around the world.",
    "hint1": "This means to grow or spread quickly",
    "hint2": "Often refers to population, ideas, or technology",
    "hint3": "From Latin 'proles' meaning offspring + 'ferre' to bear"
  },
  "prosaic": {
    "description": "commonplace; unromantic",
    "sentence": "The report was filled with prosaic details that bored the readers.",
    "hint1": "This means dull and lacking imagination",
    "hint2": "Often applies to writing or speech that is plain",
    "hint3": "From 'prose', referring to ordinary language"
  },
  "protagonist": {
    "description": "the main character in a story",
    "sentence": "The protagonist faced a moral dilemma at the story's climax.",
    "hint1": "This means the leading figure in a narrative",
    "hint2": "Often the hero or central character in plays and novels",
    "hint3": "From Greek 'protos' meaning first + 'agonistes' meaning actor"
  },
  "prudent": {
    "description": "wise in practical matters; careful",
    "sentence": "Saving for emergencies is a prudent financial habit.",
    "hint1": "This means showing good judgment and caution",
    "hint2": "Often describes careful planning or decisions",
    "hint3": "From Latin 'prudens' meaning skilled or sagacious"
  },
  "peccadillo": {
    "description": "a minor offense or sin",
    "sentence": "He apologized for his peccadillo but insisted it was a small mistake.",
    "hint1": "This means a small fault or minor misdeed",
    "hint2": "Often used to describe lighthearted or forgivable mistakes",
    "hint3": "From Spanish 'pecadillo', diminutive of 'pecado' meaning sin"
  },
  "retrospective": {
    "description": "looking back on or dealing with past events",
    "sentence": "The museum held a retrospective exhibition of the artist’s early work.",
    "hint1": "This means relating to or thinking about the past",
    "hint2": "Often used regarding exhibitions or reviews of previous work",
    "hint3": "From Latin 'retro-' meaning backward + 'specere' to look"
  },
  "rife": {
    "description": "common or widespread, especially of something undesirable",
    "sentence": "Corruption was rife in the government during that period.",
    "hint1": "This means something prevalent or widespread",
    "hint2": "Often refers to negative things like problems or diseases",
    "hint3": "A short word often used with bad or undesirable phenomena"
  },
  "rambunctious": {
    "description": "uncontrollably exuberant; boisterous",
    "sentence": "The puppies were so rambunctious, they knocked over a vase.",
    "hint1": "This means very energetic and noisy",
    "hint2": "Often describes children or animals being wild and playful",
    "hint3": "Rhymes with 'punctious' but means unruly and lively"
  },
  "ramification": {
    "description": "a consequence of an action",
    "sentence": "They considered every ramification of the proposed law.",
    "hint1": "This means a result or outcome, often complex",
    "hint2": "Often refers to indirect or unintended consequences",
    "hint3": "Related to 'branching out' like branches on a tree"
  },
  "rapacious": {
    "description": "greedy or grasping, often in a negative sense",
    "sentence": "The rapacious landlord raised the rent without warning.",
    "hint1": "This means aggressively greedy or voracious",
    "hint2": "Often used about people who take more than their fair share",
    "hint3": "From Latin 'rapere' meaning to seize or grab"
  },
  "rationalize": {
    "description": "justify with logical reasons",
    "sentence": "She tried to rationalize her decision with statistics.",
    "hint1": "This means to explain or justify behavior logically",
    "hint2": "Often involves making excuses or reasoning post-factum",
    "hint3": "From Latin 'ratio' meaning reason"
  },
  "rebut": {
    "description": "disprove by argument or evidence",
    "sentence": "He attempted to rebut the accusations in his defense.",
    "hint1": "This means to argue against or refute",
    "hint2": "Often used in debates or courtrooms",
    "hint3": "Sounds like 're-boot' meaning to push back"
  },
  "recant": {
    "description": "withdraw a statement or belief formally",
    "sentence": "Under pressure, the witness decided to recant her testimony.",
    "hint1": "This means to take back a previously held statement",
    "hint2": "Often involves admitting a previous belief was wrong",
    "hint3": "From Latin 're-' meaning back + 'cantare' to sing"
  },
  "redundancy": {
    "description": "unnecessary repetition or excess",
    "sentence": "The essay contained redundancies that needed to be removed.",
    "hint1": "This means extra or repeated information beyond necessity",
    "hint2": "Often used in writing, speech, or employment contexts",
    "hint3": "Contains 'redundare' meaning to overflow"
  },
  "rejuvenate": {
    "description": "make someone feel younger or fresher",
    "sentence": "A vacation by the ocean can really rejuvenate the mind.",
    "hint1": "This means to refresh or renew",
    "hint2": "Often refers to restoring energy or vitality",
    "hint3": "From Latin 'juvenis' meaning young"
  },
  "relinquish": {
    "description": "voluntarily give up something",
    "sentence": "He had to relinquish control of the company.",
    "hint1": "This means to surrender or let go willingly",
    "hint2": "Often used for power, rights, or possessions",
    "hint3": "From Latin 'relinquere' meaning to leave behind"
  },
  "renegade": {
    "description": "person who deserts a cause and goes independent",
    "sentence": "The spy became a renegade after defecting to the enemy.",
    "hint1": "This means a rebel or traitor",
    "hint2": "Often refers to someone abandoning a group or belief",
    "hint3": "From Spanish 'renegar' meaning to deny or renounce"
  },
  "reticent": {
    "description": "not revealing one's thoughts readily; reserved",
    "sentence": "She was reticent to speak at the meeting.",
    "hint1": "This means reserved or reluctant to speak",
    "hint2": "Often used to describe shy or cautious people",
    "hint3": "From Latin 'reticent-' meaning keeping silent"
  },
  "reverie": {
    "description": "a daydream; state of being lost in thought",
    "sentence": "Lost in reverie, he almost missed the announcement.",
    "hint1": "This means pleasant, dreamy meditation",
    "hint2": "Often involves being lost in one’s thoughts",
    "hint3": "From French 'rêver' meaning to dream"
  },
  "resilient": {
    "description": "able to recover quickly; tough",
    "sentence": "Children are often resilient and adapt to changes easily.",
    "hint1": "This means able to bounce back or recover",
    "hint2": "Often refers to people or materials that endure stress",
    "hint3": "From Latin 'resilire' meaning to leap back"
  },
  "reminisce": {
    "description": "recall past experiences or events",
    "sentence": "They would often reminisce about their college days.",
    "hint1": "This means to think or talk about past memories",
    "hint2": "Often involves sharing nostalgic stories",
    "hint3": "From Latin 'reminisci' meaning to remember"
  },
  "rescind": {
    "description": "revoke or cancel formally",
    "sentence": "They decided to rescind the offer when new information came to light.",
    "hint1": "This means to officially cancel something",
    "hint2": "Often used about laws, contracts, or agreements",
    "hint3": "From Latin 'rescindere' meaning to cut back"
  },
  "sagacious": {
    "description": "wise; having sound judgment",
    "sentence": "The sagacious leader guided the nation through crisis.",
    "hint1": "This means having keen judgment or wisdom",
    "hint2": "Often describes insightful people or decisions",
    "hint3": "From Latin 'sagax' meaning wise or shrewd"
  },
  "sanctuary": {
    "description": "a place of refuge or safety",
    "sentence": "The wounded deer found sanctuary in the forest.",
    "hint1": "This means a safe or protected place",
    "hint2": "Often used for wildlife refuges or sacred places",
    "hint3": "From Latin 'sanctuarium' meaning a holy place"
  },
  "sardonic": {
    "description": "grimly mocking or cynical",
    "sentence": "His sardonic smile annoyed his critics.",
    "hint1": "This means bitterly sarcastic or mocking",
    "hint2": "Often implies disdainful or scornful humor",
    "hint3": "From Greek island Sardinia, famous for bitter plants"
  },
  "scrupulous": {
    "description": "diligent, thorough, and principled",
    "sentence": "She was scrupulous about following every rule.",
    "hint1": "This means very careful and ethical",
    "hint2": "Often describes conscientious workers or conduct",
    "hint3": "From Latin 'scrupulus' meaning a small sharp stone, symbolizing carefulness"
  },
  "sensory": {
    "description": "relating to sensation or the senses",
    "sentence": "The spicy soup created a strong sensory experience.",
    "hint1": "This means connected to the senses",
    "hint2": "Often used in contexts involving touch, taste, sight, etc.",
    "hint3": "From Latin 'sensus' meaning perception"
  },
  "serene": {
    "description": "calm, peaceful, and untroubled",
    "sentence": "They sat by the lake enjoying the serene afternoon.",
    "hint1": "This means tranquil and unruffled",
    "hint2": "Often describes landscapes or moods",
    "hint3": "From Latin 'serenus' meaning clear or calm"
  },
  "solicit": {
    "description": "ask for or try to obtain (something)",
    "sentence": "He would often solicit feedback from his mentors.",
    "hint1": "This means to request or seek something earnestly",
    "hint2": "Often used for fundraising, advice, or help",
    "hint3": "From Latin 'sollicitare' meaning to disturb or urge"
  },
  "sophisticated": {
    "description": "developed to a high degree of complexity; refined",
    "sentence": "The new computer system has a sophisticated interface.",
    "hint1": "This means complex or highly developed",
    "hint2": "Often describes technology or cultured people",
    "hint3": "From Latin 'sophisticatus' meaning adulterated or refined"
  },
  "spontaneous": {
    "description": "performed or occurring without premeditation; impulsive",
    "sentence": "Her spontaneous decision led to a memorable adventure.",
    "hint1": "This means unplanned or impulsive",
    "hint2": "Often describes actions done without thinking",
    "hint3": "From Latin 'sponte' meaning of one’s own accord"
  },
  "succinct": {
    "description": "briefly and clearly expressed",
    "sentence": "His succinct reply answered all our questions.",
    "hint1": "This means concise and to the point",
    "hint2": "Often used to praise clear, brief communication",
    "hint3": "From Latin 'succinctus' meaning girded up, compact"
  },
  "succumb": {
    "description": "give in to pressure or temptation",
    "sentence": "She would not succumb to pressure from her friends.",
    "hint1": "This means to yield or give way",
    "hint2": "Often used in the context of illness or temptation",
    "hint3": "From Latin 'succumbere' meaning to lie under"
  },
  "superfluous": {
    "description": "unnecessary, especially more than enough",
    "sentence": "He cut out all superfluous details from the report.",
    "hint1": "This means excessive or redundant",
    "hint2": "Often used to describe extra information or items",
    "hint3": "From Latin 'superfluus' meaning flowing over"
  },
  "synoptic": {
    "description": "giving a general summary or overview",
    "sentence": "She provided a synoptic summary of the year's events.",
    "hint1": "This means presenting a summary or big picture",
    "hint2": "Often used in analysis or reviews",
    "hint3": "From Greek 'syn-' meaning together + 'opsis' meaning view"
  },
  "surreal": {
    "description": "bizarre or dreamlike; unreal",
    "sentence": "Walking into the room filled with balloons felt surreal.",
    "hint1": "This means oddly dreamlike or unreal",
    "hint2": "Often used for strange or fantastical experiences",
    "hint3": "From Latin 'super-' meaning above + 'real'"
  },
  "tacit": {
    "description": "understood without being openly expressed",
    "sentence": "They had a tacit agreement not to discuss the topic.",
    "hint1": "This means implied rather than stated",
    "hint2": "Often refers to agreements or understandings",
    "hint3": "From Latin 'tacitus' meaning silent"
  },
  "tactile": {
    "description": "relating to the sense of touch",
    "sentence": "The fabric had a pleasant tactile quality.",
    "hint1": "This means connected to the sense of touch",
    "hint2": "Often describes textures or sensations",
    "hint3": "From Latin 'tactilis' meaning capable of being touched"
  },
  "talisman": {
    "description": "an object believed to bring good luck",
    "sentence": "The old ring was considered a family talisman.",
    "hint1": "This means a lucky charm or amulet",
    "hint2": "Often believed to have magical powers",
    "hint3": "From Arabic 'tilasm' meaning magic or witchcraft"
  },
  "tantrum": {
    "description": "an uncontrolled outburst of anger",
    "sentence": "The toddler's tantrum was heard down the hall.",
    "hint1": "This means a sudden display of bad temper",
    "hint2": "Commonly associated with children",
    "hint3": "Sounds like a stomping or throwing a fit"
  },
  "tautology": {
    "description": "redundant or meaningless repetition",
    "sentence": "Saying \"free gift\" is a tautology.",
    "hint1": "This means repetitive and unnecessary wording",
    "hint2": "Often refers to logical or linguistic redundancy",
    "hint3": "From Greek 'tauto' meaning same + 'logos' meaning word"
  },
  "teeming": {
    "description": "overflowing or swarming with",
    "sentence": "The marketplace was teeming with shoppers.",
    "hint1": "This means full to overflowing",
    "hint2": "Often used about crowds or abundance",
    "hint3": "Related to the idea of 'teem' meaning to pour out"
  },
  "tangible": {
    "description": "perceptible by touch; clear and real",
    "sentence": "They needed tangible evidence before proceeding.",
    "hint1": "This means able to be touched or clearly understood",
    "hint2": "Often used in legal or practical contexts",
    "hint3": "From Latin 'tangere' meaning to touch"
  },
  "taunt": {
    "description": "to jeer at or mock someone",
    "sentence": "The older kids would often taunt the younger ones.",
    "hint1": "This means to mock or tease in a hurtful way",
    "hint2": "Often involves verbal insults or provocation",
    "hint3": "Short, sharp word often used in bullying contexts"
  },
  "thrifty": {
    "description": "using money and resources carefully; not wasteful",
    "sentence": "Being thrifty helped them save for their future.",
    "hint1": "This means careful and economical with resources",
    "hint2": "Often describes money management or spending habits",
    "hint3": "Related to 'thrift', meaning saving or economy"
  },
  "transient": {
    "description": "temporary; lasting only a short time",
    "sentence": "The beauty of the sunset was transient but unforgettable.",
    "hint1": "This means short-lived or temporary",
    "hint2": "Often used about experiences or visitors",
    "hint3": "From Latin 'transire' meaning to pass over"
  },
  "travesty": {
    "description": "a distorted or absurd representation of something",
    "sentence": "The trial was a travesty of justice, with no real evidence presented.",
    "hint1": "This means a false or exaggerated imitation",
    "hint2": "Often refers to unfair or ridiculous situations",
    "hint3": "From Italian 'travestire' meaning to disguise"
  },
  "treacherous": {
    "description": "dangerously unstable or unpredictable",
    "sentence": "The mountain road was narrow and treacherous.",
    "hint1": "This means hazardous and not to be trusted",
    "hint2": "Often describes terrain or people who betray",
    "hint3": "From Old French 'trecherie' meaning deceit"
  },
  "tribulation": {
    "description": "a cause of great trouble or suffering",
    "sentence": "She remained strong through every tribulation.",
    "hint1": "This means severe distress or hardship",
    "hint2": "Often refers to prolonged difficulties or trials",
    "hint3": "From Latin 'tribulare' meaning to press or distress"
  },
  "truculent": {
    "description": "eager to argue or fight; aggressively defiant",
    "sentence": "His truculent attitude got him into trouble.",
    "hint1": "This means aggressively combative or defiant",
    "hint2": "Often describes hostile behavior or speech",
    "hint3": "From Latin 'truculentus' meaning fierce or savage"
  },
  "turbulent": {
    "description": "characterized by conflict or disorder",
    "sentence": "The country went through a turbulent period after the war.",
    "hint1": "This means disorderly or stormy",
    "hint2": "Often refers to chaotic times or rough waters",
    "hint3": "From Latin 'turbulentus' meaning full of confusion"
  },
  "tyranny": {
    "description": "cruel and oppressive government or rule",
    "sentence": "They rebelled against the tyranny of the regime.",
    "hint1": "This means harsh and unjust rule by a leader",
    "hint2": "Often associated with dictatorships or oppression",
    "hint3": "From Greek 'tyrannos' meaning absolute ruler"
  },
  "ubiquitous": {
    "description": "present or found everywhere",
    "sentence": "Smartphones have become ubiquitous in modern society.",
    "hint1": "This means existing everywhere at once",
    "hint2": "Often used to describe common or widespread things",
    "hint3": "From Latin 'ubique' meaning everywhere"
  },
  "undermine": {
    "description": "weaken or damage something",
    "sentence": "Negative comments can undermine a person's confidence.",
    "hint1": "This means to weaken or sabotage gradually",
    "hint2": "Often refers to trust, authority, or foundations",
    "hint3": "Literally means to dig under the base of something"
  },
  "unprecedented": {
    "description": "never done or known before",
    "sentence": "The pandemic brought unprecedented challenges.",
    "hint1": "This means never occurring before",
    "hint2": "Often used for events or actions without precedent",
    "hint3": "Prefix 'un-' means not + 'precedent' meaning earlier example"
  },
  "untenable": {
    "description": "not able to be defended or justified",
    "sentence": "Her excuse was clearly untenable.",
    "hint1": "This means indefensible or impossible to maintain",
    "hint2": "Often describes arguments or positions",
    "hint3": "From Latin 'tenere' meaning to hold, with negative prefix"
  },
  "utopia": {
    "description": "an imagined perfect place or state",
    "sentence": "He dreamed of a utopia where everyone was equal.",
    "hint1": "This means an ideal or perfect society",
    "hint2": "Often used in philosophical or literary contexts",
    "hint3": "From Greek 'ou' meaning not + 'topos' place (no place)"
  },
  "usurp": {
    "description": "take a position of power illegally or by force",
    "sentence": "The general tried to usurp the throne.",
    "hint1": "This means to seize power unlawfully",
    "hint2": "Often used in context of overthrowing rulers",
    "hint3": "From Latin 'usurpare' meaning to seize for use"
  },
  "vacuous": {
    "description": "having or showing a lack of thought or intelligence",
    "sentence": "The conversation was vacuous, focused only on trivial matters.",
    "hint1": "This means empty-headed or silly",
    "hint2": "Often describes dull or mindless behavior",
    "hint3": "From Latin 'vacuus' meaning empty"
  },
  "venerate": {
    "description": "regard with great respect; revere",
    "sentence": "They venerate the ancient traditions of their culture.",
    "hint1": "This means to honor or respect deeply",
    "hint2": "Often used for religious figures or traditions",
    "hint3": "From Latin 'venerari' meaning to worship"
  },
  "venerable": {
    "description": "accorded a great deal of respect, especially because of age or wisdom",
    "sentence": "The venerable professor had taught at the university for over fifty years.",
    "hint1": "This means deserving respect due to age or dignity",
    "hint2": "Used for respected elders or institutions",
    "hint3": "Adj. form of 'venerate' with '-able' suffix"
  },
  "vengeance": {
    "description": "punishment inflicted in return for an injury or wrong",
    "sentence": "He swore vengeance for the betrayal.",
    "hint1": "This means revenge or retribution",
    "hint2": "Often fueled by anger or desire for justice",
    "hint3": "From Latin 'vindicta' meaning revenge"
  },
  "verdict": {
    "description": "a decision on a disputed issue in a civil or criminal case",
    "sentence": "The jury returned a guilty verdict after deliberation.",
    "hint1": "This means an official decision or judgment",
    "hint2": "Commonly used in legal or trial contexts",
    "hint3": "From Latin 'verdictum' meaning true saying"
  },
  "vexation": {
    "description": "the state of being annoyed or worried",
    "sentence": "Losing the keys caused great vexation.",
    "hint1": "This means annoyance or frustration",
    "hint2": "Often caused by small troubles or worries",
    "hint3": "From Latin 'vexare' meaning to shake or trouble"
  },
  "vilify": {
    "description": "speak or write about in an abusively disparaging manner",
    "sentence": "It was wrong to vilify the whistleblower for doing his job.",
    "hint1": "This means to speak ill or defame someone",
    "hint2": "Often involves harsh criticism or slander",
    "hint3": "From Latin 'vilis' meaning cheap or base"
  },
  "virtue": {
    "description": "behavior showing high moral standards",
    "sentence": "Patience is a virtue worth cultivating.",
    "hint1": "This means moral excellence or good quality",
    "hint2": "Often refers to character traits like kindness or courage",
    "hint3": "From Latin 'virtus' meaning valor or excellence"
  },
  "virtuoso": {
    "description": "a person highly skilled in music or art",
    "sentence": "She was a piano virtuoso at just twelve years old.",
    "hint1": "This means an expert performer or artist",
    "hint2": "Often used for musicians who show exceptional skill",
    "hint3": "From Italian meaning skilled or learned person"
  },
  "vociferous": {
    "description": "loud and insistent; vehement",
    "sentence": "The protesters were vociferous in their demands.",
    "hint1": "This means loudly expressing opinions or complaints",
    "hint2": "Often describes noisy protests or demands",
    "hint3": "From Latin 'vox' meaning voice + 'ferre' to carry"
  },
  "volatile": {
    "description": "liable to change rapidly and unpredictably",
    "sentence": "The political climate was volatile at the time.",
    "hint1": "This means unstable or likely to change suddenly",
    "hint2": "Often used to describe moods, markets, or environments",
    "hint3": "From Latin 'volatilis' meaning able to fly or fleeting"
  },
  "voracious": {
    "description": "having a very eager approach to an activity or devouring large amounts of food",
    "sentence": "He had a voracious appetite for learning new languages.",
    "hint1": "This means very eager or insatiable",
    "hint2": "Often describes great hunger or desire for something",
    "hint3": "From Latin 'vorare' meaning to devour"
  },
  "vulnerable": {
    "description": "exposed to the possibility of being attacked or harmed",
    "sentence": "Young seedlings are vulnerable to frost.",
    "hint1": "This means open to being hurt or affected",
    "hint2": "Often describes people, animals, or things at risk",
    "hint3": "From Latin 'vulnerare' meaning to wound"
  },
  "waive": {
    "description": "refrain from insisting on something",
    "sentence": "They decided to waive the fees for the charity.",
    "hint1": "This means to give up a claim or right voluntarily",
    "hint2": "Often used for fees, rights, or privileges",
    "hint3": "Sounds like 'wave' but means to relinquish"
  },
  "wanderlust": {
    "description": "a strong desire to travel",
    "sentence": "His wanderlust took him across five continents.",
    "hint1": "This means a strong urge to roam or travel",
    "hint2": "Often describes a love of exploring far places",
    "hint3": "From German words 'wandern' (to hike) + 'Lust' (desire)"
  },
  "warrant": {
    "description": "justify or necessitate",
    "sentence": "The evidence did not warrant such a severe punishment.",
    "hint1": "This means to justify or give a good reason for something",
    "hint2": "Often used in legal and formal reasoning",
    "hint3": "Root word also means a legal authorization"
  },
  "wary": {
    "description": "feeling or showing caution about possible dangers",
    "sentence": "She was wary of the stranger's intentions.",
    "hint1": "This means cautious and alert to potential problems",
    "hint2": "Often describes careful or suspicious behavior",
    "hint3": "Sounds like 'weary' but means watchful"
  },
  "wistful": {
    "description": "having or showing a feeling of vague or regretful longing",
    "sentence": "She gave a wistful glance at her childhood home.",
    "hint1": "This means melancholic or full of yearning",
    "hint2": "Often describes nostalgic or sad feelings",
    "hint3": "Rhymes with 'listful' and relates to longing"
  },
  "xenophobia": {
    "description": "intense or irrational dislike or fear of foreigners",
    "sentence": "A surge in xenophobia has troubled the community.",
    "hint1": "This means fear or hatred of strangers or foreigners",
    "hint2": "Often leads to discrimination or prejudice",
    "hint3": "From Greek 'xenos' meaning stranger + 'phobos' meaning fear"
  },
  "xylophone": {
    "description": "a musical instrument with wooden bars of different lengths",
    "sentence": "The musician played a tune on the xylophone.",
    "hint1": "This is a percussion instrument with wooden keys",
    "hint2": "Often used in school music classes or orchestras",
    "hint3": "From Greek 'xylon' meaning wood + 'phone' meaning sound"
  },
  "yearn": {
    "description": "have an intense feeling of longing",
    "sentence": "He would yearn for his family while on tour.",
    "hint1": "This means to strongly desire or long for something",
    "hint2": "Often used for emotional or heartfelt wishes",
    "hint3": "A short verb rhyming with 'turn'"
  },
  "yoke": {
    "description": "to join together or harness animals",
    "sentence": "Farmers used an oxen yoke to plow the field.",
    "hint1": "This means to join or link together",
    "hint2": "Often refers to harnessing animals or binding forces",
    "hint3": "A short three-letter word, also a farming tool"
  },
  "zeal": {
    "description": "great energy or enthusiasm in pursuit of a cause",
    "sentence": "Her zeal for baking filled the kitchen with fresh bread.",
    "hint1": "This means passionate energy or eagerness",
    "hint2": "Often describes enthusiastic devotion to a goal",
    "hint3": "A short, one-syllable word rhyming with 'peal'"
  },
  "zenith": {
    "description": "the highest point or peak",
    "sentence": "He reached the zenith of his career at age forty.",
    "hint1": "This means the highest or culminating point",
    "hint2": "Often used in astronomy or metaphorically for success",
    "hint3": "Starts with 'zen' similar to 'zenith' in height"
  },
  "zephyr": {
    "description": "a gentle breeze",
    "sentence": "A zephyr blew through the open window on a summer day.",
    "hint1": "This means a soft, mild wind",
    "hint2": "Often used poetically or in nature descriptions",
    "hint3": "From Greek god of the west wind"
  }
}
